<template>
  <div class="box">
    <input type="text" v-model="musicMsg" placeholder="歌曲/歌手" autofocus="autofocus">
    <span @click="Check">
      <svg class="icon" style="" viewBox="0 0 1024 1024" version="1.1" xmlns="http://www.w3.org/2000/svg" p-id="1963" width="32" height="32">
        <path d="M785.664823 352.59243c-35.701107-102.302991-119.413694-180.216501-223.932142-208.419843-11.665691-3.115967-23.76731 3.770883-26.936489 15.490809-3.158946 11.714809 3.776 23.772426 15.490809 26.936489 90.49199 24.416086 162.977885 91.88164 193.895036 180.474375 3.158946 9.05933 11.655458 14.734586 20.741393 14.734586 2.397606 0 4.843308-0.397043 7.240915-1.234108 11.45182-3.996011 17.502629-16.525372 13.500478-27.982308zM1009.833349 959.539896L791.889595 741.596142c66.61621-74.767867 107.202581-173.206854 107.202581-280.988626 0-233.200226-189.721992-422.922219-422.922219-422.922219s-422.922219 189.721992-422.922219 422.922219 189.721992 422.922219 422.922219 422.922219c109.644189 0 209.662137-41.954531 284.883329-110.63475L978.765773 990.606449a21.890566 21.890566 0 0 0 15.533788 6.436596 21.89159 21.89159 0 0 0 15.533788-6.436596c8.581446-8.576329 8.581446-22.490224 0-31.066553zM476.17098 839.58999c-208.972429 0-378.981451-170.010045-378.981451-378.981451s170.010045-378.981451 378.981451-378.98145 378.981451 170.010045 378.981451 378.98145-170.009022 378.981451-378.981451 378.981451z" p-id="1964"></path>
      </svg>
    </span>
  </div>
</template>

<script>
export default {
  name: 'search',
  data () {
    return {
      musicMsg: ''
    }
  },
  methods: {
    Check () {
      if (this.musicMsg !== '') {
        this.$emit('getMusicList', this.musicMsg)
      }
    }
  }
}
</script>

<style scoped>
  .box{
    border: 2px solid rgba(255, 0, 0, 0.8);
    text-align: center;
    width: 90%;
    margin: 0 auto;
    height: 40px;
    line-height: 40px;
    border-radius: 20px;
  }
  .box input{
    vertical-align: middle;
    font-size: 16px;
    outline: none;
    text-align: center;
    border: none;
    width: 70%;
    background: none;
    padding-left: 32px;
  }
  .box svg{
    vertical-align: middle;
    fill: rgba(255, 0, 0, 0.8);
  }
</style>
